// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//
let arr=[2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let i=0
while  (i < arr.length ) {
    console.log(arr [i]);
    i++
}
// //     2. перебрати його циклом for

let numbers=[2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i=0; i<numbers.length; i++) {
    console.log(numbers[i])
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

let numbers1 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
 let i = 0

while (i < numbers1.length){
    if (i % 2!==0) {
        console.log(numbers1[i]);
    }
    i++
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом


let numbers2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = 0; i < numbers2.length; i++)
    if (i % 2!== 0) {
        console.log(numbers2[i])
    }


// 5. перебрати циклом while та вивести  числа тільки парні  значення

let numbers1 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
 let i = 0

while (i < numbers1.length){
    if (i % 2 === 0) {
        console.log(numbers1[i]);
    }
    i++
}


// 6. перебрати циклом for та вивести  числа тільки парні  значення



 let numbers2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = 0; i < numbers2.length; i++)
    if (i % 2=== 0) {
        console.log(numbers2[i])
    }


// 7. замінити кожне число кратне 3 на слово "okten"

let array = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = 0; i < array.length; i++) {
    if (array[i] % 2!== 0)
        array[i]= 'okten'
     console.log(array[i])
}



// 8. вивести масив в зворотньому порядку.

let numbers4 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = numbers4.length-1; i >= 0; i-- ) {
    console.log(numbers4[i]);
}


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

//9.1  перебрати його циклом while  у зворотньому порядку

let arr=[2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let  i = arr.length-1;
while  (  i >= 0  ){
    console.log(arr [i]);
i--
}
// __________________________________________
// 9.2 перебрати його циклом for у зворотньому порядку

let numbers=[2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let  i= numbers.length-1; i >= 0; i-- ) {

    console.log(numbers[i])
}
// ____________________________________________
// 9.3 перебрати циклом while та вивести  числа тільки з непарним індексом  у зворотньому порядку

let numbers1 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let i= numbers1.length-1;
while (i >= 0)  {
    if (i % 2!== 0) {
        console.log(numbers1[i]);
    }
    i--
}
// ___________________________________________
//  9.4 перебрати циклом for та вивести  числа тільки з непарним індексом у зворотньому порядку


let numbers2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let  i = numbers2.length-1;i >= 0; i--)
    if (i % 2!== 0) {
        console.log(numbers2[i])
    }

// ______________________________________________
//  9.5 перебрати циклом while та вивести  числа тільки парні  значення у зворотньому порядку
//
let numbers1 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
 let i =  numbers1.length-1 ;

while ( i >= 0 ){
    if (i % 2 === 0) {
        console.log(numbers1[i]);
    }
    i--
}
// ______________________________________________
// 9.6 перебрати циклом for та вивести  числа тільки парні  значення у зворотньому порядку


 let numbers2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let  i = numbers2.length-1; i >= 0; i--)
    if (i % 2=== 0) {
        console.log(numbers2[i])
    }
// _________________________________________________
// 9.7 замінити кожне число кратне 3 на слово "okten" у зворотньому порядку

let array = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let  i= array.length-1; i >= 0; i--) {
    if (array[i] % 2!== 0)
        array[i]= 'okten'
     console.log(array[i])
}
